system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object controlDict;
}

    application interFoam;
    startFrom startTime;
    startTime 0;
    stopAt endTime;
    endTime 60;
    deltaT 0.000001;
    writeControl adjustableRunTime;
    writeInterval 0.01;
    purgeWrite 0;
    writeFormat ascii;
    writePrecision 6;
    writeCompression uncompressed;
    timeFormat general;
    timePrecision 6;
    runTimeModifiable yes;
    adjustTimeStep on;
    maxCo 0.5;
    maxAlphaCo 0.5;
    maxDeltaT 0.1;