0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.00 0 0);

boundaryField
{
    aboveIn
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    in
    {
        type            outletInlet;
        outletValue     uniform (0 0 0);
        value           uniform (0 0 0);
    }
    out
    {
        type            zeroGradient;
    }
    aboveOut
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    fundo
    {
        type            noSlip;
    }
    atmosfera
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.00 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
