0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
18493
(
0
0
0
1
1
1
0
0
...
)
;

boundaryField
{
    aboveIn
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    in
    {
        type            fixedValue;
        value           uniform 1;
    }
    out
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    aboveOut
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    fundo
    {
        type            zeroGradient;
    }
    atmosfera
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
