0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2.35e-03;  // do sharpCrestedWeir

boundaryField
{
  in
    {
        type            fixedValue;
	value           uniform 0.0023;
	//value           $internalField;
    }
    aboveIn
    {
        type            inletOutlet;
	inletValue      uniform 0.0023;
	value           uniform 0.0023;
	//inletValue  $internalField;
       // value          $internalField;
    }
       out
    {
        type            inletOutlet;
	inletValue      uniform 0.0023;
	value           uniform 0.0023;
    }
    aboveOut
    {
        type            inletOutlet;
	inletValue      uniform 0.0023;
	value           uniform 0.0023;
}
    fundo
    {
	type            epsilonWallFunction;
	Cmu             0.09;
	kappa           0.41;
	E               9.8;
	value           uniform 0.0023;
    }
    atmosfera
    {
        type            inletOutlet;
	inletValue    uniform 0.0023;
	value           uniform 0.0023;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
