0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.0;  // veio do sharpCrestedWeir
 
boundaryField
{
in
    {
        type            calculated;
        value           $internalField;
    }
aboveIn
    {
        type            calculated;
        value          $internalField;
    }
out
    {
        type            calculated;
        value           $internalField;
    }
aboveOut
    {
        type            calculated;
        value           $internalField;
    }
    fundo
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    atmosfera
    {
        type            calculated;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
