system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object fvSolution;
}

    solvers
    {
        "alpha.water.*"
        {
            nAlphaCorr 2;
            nAlphaSubCycles 1;
            cAlpha 1;
            MULESCorr yes;
            nLimiterIter 3;
            solver smoothSolver;
            smoother symGaussSeidel;
            tolerance 1e-8;
            relTol 0;
        }

        pcorr
        {
            solver PCG;
            preconditioner DIC;
            tolerance 1e-5;
            relTol 0;
        }

        p_rgh
        {
            solver PCG;
            preconditioner DIC;
            tolerance 1e-07;
            relTol 0.05;
        }

        p_rghFinal
        {
            relTol 0.05;
            solver PCG;
            preconditioner DIC;
            tolerance 1e-07;
        }

        "U.*"
        {
            solver smoothSolver;
            smoother symGaussSeidel;
            tolerance 1e-06;
            relTol 0;
            minIter 1;
        }

        "k.*"
        {
            solver smoothSolver;
            smoother symGaussSeidel;
            tolerance 1e-06;
            relTol 0;
            minIter 1;
        }

        "epsilon.*"
        {
            solver smoothSolver;
            smoother symGaussSeidel;
            tolerance 1e-06;
            relTol 0;
            minIter 1;
        }

    }

    PIMPLE
    {
        momentumPredictor no;
        nOuterCorrectors 1;
        nCorrectors 3;
        nNonOrthogonalCorrectors 0;
    }

    relaxationFactors
    {
        equations
        {
            ".*" 1;
        }

    }
